[
  {
    "id": 1,
    "title": "The Great Gatsby",
    "isbn": 9780743273565,
    "image": "/src/assets/images/book-1.webp",
    "author": "F. Scott Fitzgerald",
    "genre": "Classic Fiction",
    "category": "fiction",
    "description": "Set in the glittering world of the Jazz Age, 'The Great Gatsby' is a profound exploration of ambition, love, and the pursuit of the American Dream. The story follows Nick Carraway, a young man who moves to Long Island and becomes entangled in the lives of his mysterious neighbor, Jay Gatsby, and the elite social circles of East Egg. Gatsby, a self-made millionaire, harbors an obsessive longing to rekindle his romance with Daisy Buchanan, who is now married to the arrogant and wealthy Tom Buchanan. Through Nick's eyes, readers witness Gatsby's grand parties, his unwavering hope, and the moral decay that underlies the era's glitz and glamour.\nFitzgerald's novel captures the disillusionment of a generation chasing hollow dreams in a society defined by materialism and superficial success. Richly layered with symbolism, from the green light at the end of Daisy's dock to the haunting eyes of Dr. T.J. Eckleburg, the narrative critiques the empty promises of wealth and status. With its unforgettable characters, lyrical prose, and timeless themes, 'The Great Gatsby' stands as a masterpiece of American literature, resonating with readers across generations.",
    "price": 45.0,
    "review": 4.4,
    "soldUnits": 171,
    "stock": 148,
    "language": "english"
  },
  {
    "id": 2,
    "title": "To Kill a Mockingbird",
    "isbn": 9780061120084,
    "image": "/src/assets/images/book-2.webp",
    "author": "Harper Lee",
    "genre": "Classic Fiction",
    "category": "fiction",
    "description": "Set in the racially segregated Deep South of the 1930s, 'To Kill a Mockingbird' is a timeless tale of justice, morality, and human empathy. The story is narrated by young Scout Finch, who lives with her older brother, Jem, and their widowed father, Atticus, in the small town of Maycomb, Alabama. When Atticus, a principled lawyer, agrees to defend Tom Robinson, a Black man falsely accused of assaulting a white woman, the Finch family faces prejudice and hostility from the community. Through Scout's innocent perspective, readers experience the complexities of human behavior, the harsh realities of systemic racism, and the power of compassion and courage.\nInspired by events from Harper Lee's own childhood, the novel masterfully weaves together themes of social inequality, innocence, and the loss of it, as well as the enduring strength of moral integrity. Its richly drawn characters, such as the enigmatic Boo Radley and the honorable Atticus Finch, have become enduring symbols in American literature. 'To Kill a Mockingbird' continues to resonate with readers for its poignant storytelling, evocative depiction of a troubled society, and its urgent call for empathy and justice.",
    "price": 54.0,
    "review": 4.3,
    "soldUnits": 1388,
    "stock": 0,
    "language": "english"
  },
  {
    "id": 3,
    "title": "1984",
    "isbn": 9780451524935,
    "image": "/src/assets/images/book-3.webp",
    "author": "George Orwell",
    "genre": "Dystopian Fiction",
    "category": "fiction",
    "description": "George Orwell's '1984' is a haunting dystopian novel that explores the perils of totalitarianism, mass surveillance, and the suppression of individual freedom. Set in a bleak world governed by the Party and its leader, Big Brother, the story follows Winston Smith, a disillusioned worker at the Ministry of Truth, where history is rewritten to serve the regime's propaganda. Big Brother's gaze looms over every aspect of life, and the Thought Police ensure complete obedience by punishing even the smallest acts of dissent.\nAmid this oppressive environment, Winston dares to defy the Party by pursuing a forbidden love with Julia and secretly questioning the regime's authority. As he discovers fragments of hope and individuality, the grim reality of totalitarian control threatens to crush his rebellion. '1984' remains a chilling and thought-provoking masterpiece, offering a sobering commentary on power, truth, and the fragility of human rights. Its themes and warnings continue to resonate with readers, serving as a cautionary tale for generations to come.",
    "price": 68.0,
    "review": 4.3,
    "soldUnits": 100,
    "stock": 0,
    "language": "english"
  },
  {
    "id": 4,
    "title": "活着",
    "isbn": 9787506365437,
    "image": "/src/assets/images/book-4.webp",
    "author": "余华",
    "genre": "现代文学",
    "category": "fiction",
    "description": "《活着》是余华的一部震撼人心的小说，充满着对生命的深刻思考和对人性的深切关注。小说通过主人公福贵的视角，描绘了一个普通人在中国动荡年代的生存历程。从昔日的地主少爷到家道中落的平民，福贵的人生经历了战争的残酷、饥荒的折磨以及政治运动的冲击。但无论面临多大的苦难，他始终保持顽强的生命力，展现了人类在逆境中的挣扎与韧性。\n余华用朴实却深刻的笔触记录了福贵的一生，同时揭示了社会变迁对个体命运的深远影响。通过这一生命历程，读者不仅感受到主人公对生存的执着，更领悟到生命的无常和珍贵。无论是对生命的反思还是对苦难的直面，《活着》都让人动容，是一部无法忘却的文学经典。",
    "price": 48.0,
    "review": 4.8,
    "soldUnits": 501,
    "stock": 322,
    "language": "chinese"
  },
  {
    "id": 5,
    "title": "三国演义",
    "isbn": 9787020024759,
    "image": "/src/assets/images/book-5.webp",
    "author": "罗贯中",
    "genre": "历史小说",
    "category": "historical",
    "description": "《三国演义》是中国古代四大名著之一，由罗贯中创作，以东汉末年到三国时期的历史为背景，展现了群雄逐鹿的恢弘画卷。小说以“忠义”为核心思想，通过跌宕起伏的情节和生动的人物描写，塑造了许多经典的英雄形象，如仁德之君刘备、义薄云天的关羽以及足智多谋的诸葛亮。这些人物不仅表现出鲜明的性格特点，也成为后世忠诚与智慧的象征。\n全书融历史、战争、政治与人性于一体，通过扣人心弦的故事情节揭示了权力斗争与英雄悲歌的主题。无论是三顾茅庐、赤壁之战，还是白帝托孤等经典场景，读者都能感受到历史的沉重与时代的波澜壮阔。《三国演义》不仅是一部历史小说，更是一部关于智慧与谋略的不朽经典。",
    "price": 60.0,
    "review": 4.8,
    "soldUnits": 1500,
    "stock": 129,
    "language": "chinese"
  },
  {
    "id": 6,
    "title": "水浒传",
    "isbn": 9787020030422,
    "image": "/src/assets/images/book-6.webp",
    "author": "施耐庵",
    "genre": "侠义小说",
    "category": "fiction",
    "description": "《水浒传》是中国古代四大名著之一，由施耐庵创作，以北宋末年的社会动荡为背景，讲述了108位梁山好汉反抗压迫、劫富济贫的传奇故事。小说以“忠义”为核心，生动刻画了英雄群体的多样性格和他们对抗不公的英勇事迹。宋江、林冲、鲁智深、武松等人物形象鲜明，各具特色，展现了他们在复杂环境中的忠诚、勇气与智慧。\n小说不仅描绘了梁山好汉的义举与豪情，还通过跌宕起伏的故事情节反映了当时社会的黑暗和腐败，以及百姓的苦难和反抗精神。无论是热血沸腾的战斗场景还是兄弟间的深厚情谊，《水浒传》都以其深刻的主题和精彩的叙事，成为一部影响深远的文学经典。",
    "price": 65.0,
    "review": 4.7,
    "soldUnits": 1200,
    "stock": 98,
    "language": "chinese"
  },
  {
    "id": 7,
    "title": "西游记",
    "isbn": 9787020010028,
    "image": "/src/assets/images/book-7.webp",
    "author": "吴承恩",
    "genre": "神话小说",
    "category": "fiction",
    "description": "《西游记》是中国四大名著之一，由吴承恩创作，以唐僧取经的真实历史为基础，融合了丰富的神话和想象，讲述了唐僧师徒四人西天取经的传奇冒险故事。孙悟空以其机智与勇敢成为家喻户晓的英雄，猪八戒的滑稽性格和沙僧的忠厚也为故事增添了幽默与深度。一路上，他们降妖伏魔，克服了九九八十一难，展现了师徒间的团结与毅力。\n这部小说不仅是一部充满奇幻色彩的冒险故事，还通过寓言和隐喻探讨了人性、道德和信仰等深刻主题。它以精彩的情节、栩栩如生的人物和寓教于乐的故事情节，成为一部流传百世的经典之作。《西游记》至今仍是中国文学史上的不朽瑰宝，对后世的文化与创作产生了深远的影响。",
    "price": 55.0,
    "review": 4.9,
    "soldUnits": 1401,
    "stock": 339,
    "language": "chinese"
  },
  {
    "id": 8,
    "title": "红楼梦",
    "isbn": 9787020002207,
    "image": "/src/assets/images/book-8.webp",
    "author": "曹雪芹",
    "genre": "古典文学",
    "category": "fiction",
    "description": "《红楼梦》是中国古典文学的巅峰之作，由曹雪芹创作，以贾宝玉、林黛玉和薛宝钗之间的爱情纠葛为主线，描绘了贾府从鼎盛走向衰败的家族兴衰史。小说通过贾宝玉与众多女性角色的互动，展现了封建家族内部的复杂人际关系，同时深刻揭示了封建社会的伦理道德与阶级制度的压迫性。林黛玉的清高孤傲与薛宝钗的端庄大气形成鲜明对比，而贾宝玉的叛逆性格更为故事增添了浓厚的悲剧色彩。\n《红楼梦》不仅是一部爱情悲剧，更是一部封建社会的百科全书。小说通过细腻的语言和对生活的逼真描写，刻画了众多性格鲜明的人物，展现了封建家族的荣辱兴衰以及个人命运与时代变迁的紧密联系。作为中国四大名著之一，《红楼梦》以其深刻的思想内涵和艺术成就，在文学史上具有不可撼动的地位，对后世的文学和文化发展产生了深远影响。",
    "price": 88.0,
    "review": 4.9,
    "soldUnits": 1000,
    "stock": 68,
    "language": "chinese"
  },
  {
    "id": 9,
    "title": "围城",
    "isbn": 9787530210785,
    "image": "/src/assets/images/book-9.webp",
    "author": "钱钟书",
    "genre": "讽刺文学",
    "category": "fiction",
    "description": "《围城》是一部充满智慧与幽默的小说，由钱钟书创作，讲述了主人公方鸿渐的成长历程及其在婚姻、职场等方面的种种困境与矛盾。小说通过方鸿渐的生活经历，展示了知识分子在社会变迁中的无力感以及对个人命运的焦虑。通过讽刺与幽默的语言，钱钟书细致刻画了人物的复杂心理，揭示了社会对个人选择的压迫与影响。\n书名《围城》本身便蕴含着深刻的哲理，象征着一种“城内想逃，城外想进”的人生困境。这部作品不仅讽刺了社会、婚姻和职场的荒谬现象，更深刻探讨了人们在面对理想与现实冲突时的无奈与挣扎。《围城》既是对个体命运的深刻描绘，也是对时代背景下知识分子群体的深刻反思，展现了极具文学价值的社会讽刺精神。",
    "price": 55.0,
    "review": 4.7,
    "soldUnits": 850,
    "stock": 340,
    "language": "chinese"
  },
  {
    "id": 10,
    "title": "平凡的世界",
    "isbn": 9787506365438,
    "image": "/src/assets/images/book-10.webp",
    "author": "路遥",
    "genre": "现代文学",
    "category": "fiction",
    "description": "《平凡的世界》是路遥创作的一部长篇小说，讲述了主人公孙少平在改革开放前后，经历的成长与奋斗历程。小说通过描绘少平及其家庭成员的生活状态，展现了中国社会在20世纪70年代末至80年代初的社会变革。小说触及到家庭、爱情、理想与现实的冲突，并通过人物的奋斗历程，反映了普通人在变革时代中的生活艰辛与坚韧。\n《平凡的世界》不仅是对个体命运的深刻描写，也充满着对中国社会转型期的思考。作者以现实主义的笔触，展现了人物在社会压力下的坚强与无奈，作品以生动的细节和丰富的情感打动读者，是中国现代文学中的经典之作。",
    "price": 58.0,
    "review": 4.9,
    "soldUnits": 2200,
    "stock": 500,
    "language": "chinese"
  },
  {
    "id": 11,
    "title": "茶馆",
    "isbn": 9787108005075,
    "image": "/src/assets/images/book-11.webp",
    "author": "老舍",
    "genre": "戏剧文学",
    "category": "fiction",
    "description": "《茶馆》是老舍大师的代表作之一，作品通过一座北京茶馆的故事，生动展现了清朝末年到新中国成立三十年间的社会变迁。这部作品以茶馆为独特的社会缩影，描绘了从上层社会到底层百姓的各色人物，借由他们的喜怒哀乐，反映出一个时代的风云变幻。书中的人物栩栩如生，既有商人、士人，也有老百姓，他们在茶馆这个小小的空间内上演着一幕幕人性的悲欢离合，揭示了时代巨变对个人命运的影响。 \n《茶馆》不仅是一部描写北京民众日常生活的戏剧作品，更通过巧妙的讽刺和深刻的社会观察，展现了旧社会的腐化、虚伪和无奈。它直面了中国社会的阴暗面，深刻批判了腐败官员、压迫人民的势力以及传统文化中存在的种种弊病，同时也深情描绘了普通人在这种压迫下的坚韧与奋斗。 \n这部作品的最大魅力在于它揭示了社会与人性的深层联系，提醒我们在历史的洪流中，每个人都无法脱离时代的桎梏。通过《茶馆》，你不仅能感受到一个世纪前中国社会的变迁，还能对当下社会的种种现象产生深刻的思考。它是中国现代文学的重要组成部分，也是每一位热爱历史与社会学的读者必读的经典。 \n无论你对老舍的其他作品是否熟悉，《茶馆》都将以其强烈的历史感、人物描写与社会批判为你打开一扇洞察人性与社会的窗，让你在剧烈的社会变动中，感受到个体命运与历史大潮之间的紧密联系。",
    "price": 60.0,
    "review": 4.6,
    "soldUnits": 750,
    "stock": 8,
    "language": "chinese"
  },
  {
    "id": 12,
    "title": "子夜",
    "isbn": 9787020023505,
    "image": "/src/assets/images/book-12.webp",
    "author": "茅盾",
    "genre": "现代文学",
    "category": "fiction",
    "description": "《子夜》揭示了20世纪初期中国的经济与社会问题，重点描写了政治和人性之间的深刻冲突。",
    "price": 48.0,
    "review": 4.5,
    "soldUnits": 600,
    "stock": 129,
    "language": "chinese"
  },
  {
    "id": 13,
    "title": "狂人日记",
    "isbn": 9787108009912,
    "image": "/src/assets/images/book-13.webp",
    "author": "鲁迅",
    "genre": "小说",
    "category": "fiction",
    "description": "《狂人日记》是鲁迅的代表作之一，通过一个疯子的眼睛反映了封建社会对人性的压迫，深刻揭示了社会病态。",
    "price": 35.0,
    "review": 4.8,
    "soldUnits": 1100,
    "stock": 3,
    "language": "chinese"
  },
  {
    "id": 14,
    "title": "白鹿原",
    "isbn": 9787108017597,
    "image": "/src/assets/images/book-14.webp",
    "author": "陈忠实",
    "genre": "乡土文学",
    "category": "fiction",
    "description": "《白鹿原》是对中国西北农村几代人的历史、生活和情感的深刻描写，充满了土地与家族的纠葛。",
    "price": 85.0,
    "review": 4.8,
    "soldUnits": 950,
    "stock": 10,
    "language": "chinese"
  },
  {
    "id": 15,
    "title": "京华烟云",
    "isbn": 9787108014466,
    "image": "/src/assets/images/book-15.webp",
    "author": "林语堂",
    "genre": "历史小说",
    "category": "historical",
    "description": "《京华烟云》以20世纪初的北京为背景，讲述了一个家族的兴衰，揭示了社会风貌和人性的复杂。",
    "price": 90.0,
    "review": 4.6,
    "soldUnits": 800,
    "stock": 42,
    "language": "chinese"
  },
  {
    "id": 16,
    "title": "檀香刑",
    "isbn": 9787506367432,
    "image": "/src/assets/images/book-16.webp",
    "author": "莫言",
    "genre": "历史小说",
    "category": "historical",
    "description": "《檀香刑》以清朝末年为背景，讲述了一段复杂的历史，融合了神话、历史和现实。",
    "price": 95.0,
    "review": 4.7,
    "soldUnits": 1050,
    "stock": 542,
    "language": "chinese"
  },
  {
    "id": 17,
    "title": "家",
    "isbn": 9787020018014,
    "image": "/src/assets/images/book-17.webp",
    "author": "巴金",
    "genre": "家庭伦理",
    "category": "fiction",
    "description": "《家》描绘了中国早期20世纪社会的家庭生活，反映了人们在传统与现代化之间的挣扎。",
    "price": 52.0,
    "review": 4.6,
    "soldUnits": 980,
    "stock": 345,
    "language": "chinese"
  },
  {
    "id": 18,
    "title": "红高粱家族",
    "isbn": 9787506364196,
    "image": "/src/assets/images/book-18.webp",
    "author": "莫言",
    "genre": "小说",
    "category": "fiction",
    "description": "《红高粱家族》通过一系列震撼人心的历史事件，展示了中国农村的文化风貌及其复杂的历史变迁。",
    "price": 72.0,
    "review": 4.8,
    "soldUnits": 600,
    "stock": 120,
    "language": "chinese"
  },
  {
    "id": 19,
    "title": "阿Q正传",
    "isbn": 9787108009929,
    "image": "/src/assets/images/book-19.webp",
    "author": "鲁迅",
    "genre": "小说",
    "category": "fiction",
    "description": "《阿Q正传》通过主人公阿Q的悲剧人生，反映了社会底层人民的命运，具有深刻的讽刺意义。",
    "price": 45.0,
    "review": 4.7,
    "soldUnits": 1150,
    "stock": 13,
    "language": "chinese"
  },
  {
    "id": 20,
    "title": "Pride and Prejudice",
    "isbn": 9780679783268,
    "image": "/src/assets/images/book-20.webp",
    "author": "Jane Austen",
    "genre": "Romance/Classic",
    "category": "fiction",
    "description": "A romantic critique of 19th-century English societal norms, following Elizabeth Bennet\u0027s journey. Pride and Prejudice has charmed generations of readers for more than two centuries. Jane Austen\u0027s much-adapted novel is famed for its witty, spirited heroine, sensational romances, and deft remarks on the triumphs and pitfalls of social convention. Author Jane Austen (1775-1817) was an English novelist whose works of social realism achieved unprecedented critical and popular success, though Austen herself remained an anonymous writer throughout her life.",
    "price": 36.0,
    "review": 4.3,
    "soldUnits": 1150,
    "stock": 355,
    "language": "english"
  },
  {
    "id": 21,
    "title": "Here One Moment",
    "isbn": 9780593798607,
    "image": "/src/assets/images/book-21.webp",
    "author": "Liane Moriarty",
    "genre": "Mystery Thriller",
    "category": "fiction",
    "description": "On a routine domestic flight, something extraordinary happens—passengers learn exactly when they’ll die. For most, it’s far in the future, but six passengers are told their deaths are near. None will forget \u0027The Death Lady,\u0027 an unremarkable woman who vanished after the flight. When her predictions start coming true, panic spreads, and lives are forever altered. In Here One Moment, Liane Moriarty explores fate, free will, and the choices we make when time is running out, weaving suspense with humor and deep insight into human nature.",
    "price": 57.0,
    "review": 4.1,
    "soldUnits": 1150,
    "stock": 14,
    "language": "english"
  },
  {
    "id": 22,
    "title": "Moby-Dick or, The Whale",
    "isbn": 9781851244422,
    "image": "/src/assets/images/book-22.webp",
    "author": "Herman Melville",
    "genre": "Adventure Fiction",
    "category": "fiction",
    "description": "An epic tale of obsession and revenge, *Moby-Dick* follows Captain Ahab’s relentless pursuit of the elusive white whale, Moby-Dick, across the vast and treacherous oceans. The novel is narrated by Ishmael, a sailor who joins Ahab's whaling expedition. As the story unfolds, it delves deeply into themes of fate, free will, and the pursuit of knowledge, as Ahab becomes consumed by his quest to capture the whale that severed his leg. The sea, in all its vastness and mystery, serves as a backdrop for Ahab’s inner turmoil, and his obsession drives him to madness, illustrating the destructive power of revenge.\nMelville's masterwork is a philosophical exploration of human nature, the complexities of obsession, and the futility of seeking control over the uncontrollable forces of the world. Through vivid depictions of life at sea, detailed accounts of whaling, and profound reflections on existence, *Moby-Dick* captures the relentless struggle between man and nature, as well as the power and mystery of the sea. The novel continues to resonate with readers due to its exploration of universal themes, making it a timeless classic in American literature.",
    "price": 60.0,
    "review": 4.5,
    "soldUnits": 600,
    "stock": 23,
    "language": "english"
  },
  {
    "id": 23,
    "title": "Wuthering Heights",
    "isbn": 9780141439556,
    "image": "/src/assets/images/book-23.webp",
    "author": "Emily Brontë",
    "genre": "Gothic Fiction",
    "category": "fiction",
    "description": "A tale of passionate and destructive love, Wuthering Heights explores the turbulent relationships between Heathcliff, Catherine, and their families, set on the remote Yorkshire moors.",
    "price": 45.0,
    "review": 4.4,
    "soldUnits": 800,
    "stock": 319,
    "language": "english"
  },
  {
    "id": 24,
    "title": "The Catcher in the Rye",
    "isbn": 9780316769488,
    "image": "/src/assets/images/book-24.webp",
    "author": "J.D. Salinger",
    "genre": "Young Adult Fiction",
    "category": "fiction",
    "description": "A landmark novel in American literature, it follows Holden Caulfield\u0027s journey through New York City as he grapples with the complexities of adolescence, alienation, and growing up.",
    "price": 40.0,
    "review": 4.3,
    "soldUnits": 1300,
    "stock": 493,
    "language": "english"
  },
  {
    "id": 25,
    "title": "Frankenstein",
    "isbn": 9780486282114,
    "image": "/src/assets/images/book-25.webp",
    "author": "Mary Shelley",
    "genre": "Gothic Horror",
    "category": "fiction",
    "description": "Mary Shelley\u0027s seminal work tells the story of Victor Frankenstein\u0027s creation of a living being and the monster\u0027s tragic search for belonging, exploring themes of creation, responsibility, and the nature of humanity.",
    "price": 50.0,
    "review": 4.4,
    "soldUnits": 900,
    "stock": 350,
    "language": "english"
  },
  {
    "id": 26,
    "title": "Jane Eyre",
    "isbn": 9780141441146,
    "image": "/src/assets/images/book-26.webp",
    "author": "Charlotte Brontë",
    "genre": "Gothic Fiction",
    "category": "fiction",
    "description": "The story of the orphaned Jane Eyre, who rises above her circumstances, eventually falling in love with the enigmatic Mr. Rochester. This novel explores themes of morality, social criticism, and independence.",
    "price": 55.0,
    "review": 4.5,
    "soldUnits": 1100,
    "stock": 349,
    "language": "english"
  },
  {
    "id": 27,
    "title": "The Picture of Dorian Gray",
    "isbn": 9780141439570,
    "image": "/src/assets/images/book-27.webp",
    "author": "Oscar Wilde",
    "genre": "Philosophical Fiction",
    "category": "fiction",
    "description": "A young man’s wish for eternal youth and beauty leads him down a path of corruption and moral degradation. Wilde\u0027s exploration of vanity, decadence, and morality continues to resonate with modern readers.",
    "price": 50.0,
    "review": 4.3,
    "soldUnits": 700,
    "stock": 255,
    "language": "english"
  },
  {
    "id": 28,
    "title": "Dracula",
    "isbn": 9781853260867,
    "image": "/src/assets/images/book-28.webp",
    "author": "Bram Stoker",
    "genre": "Horror Fiction",
    "category": "fiction",
    "description": "The classic Gothic novel of Count Dracula\u0027s attempt to move from Transylvania to England to spread the undead curse, and the group of people who try to stop him. A story of love, horror, and immortality.",
    "price": 45.0,
    "review": 4.4,
    "soldUnits": 1200,
    "stock": 110,
    "language": "english"
  },
  {
    "id": 29,
    "title": "Brave New World",
    "isbn": 9780060850524,
    "image": "/src/assets/images/book-29.webp",
    "author": "Aldous Huxley",
    "genre": "Dystopian Fiction",
    "category": "fiction",
    "description": "A dystopian society where technology and social control have reached oppressive levels. The novel critiques consumerism, class division, and the loss of individuality in a future dominated by artificial happiness.",
    "price": 60.0,
    "review": 4.5,
    "soldUnits": 1100,
    "stock": 349,
    "language": "english"
  },
  {
    "id": 30,
    "title": "The Odyssey",
    "isbn": 9780140268867,
    "image": "/src/assets/images/book-30.webp",
    "author": "Homer",
    "genre": "Epic Poetry",
    "category": "fiction",
    "description": "The ancient Greek epic poem recounts the adventures of Odysseus as he strives to return home after the Trojan War, encountering mythical creatures and challenges along the way. A tale of perseverance and the hero\u0027s journey.",
    "price": 40.0,
    "review": 4.6,
    "soldUnits": 800,
    "stock": 254,
    "language": "english"
  },
  {
    "id": 31,
    "title": "Hikayat Hang Tuah",
    "isbn": 9789675082436,
    "image": "/src/assets/images/book-31.webp",
    "author": "Kassim Ahmad",
    "genre": "Epic Literature",
    "category": "fiction",
    "description": "Sebuah epik klasik Melayu yang mengisahkan tentang pahlawan legendaris Hang Tuah, seorang tokoh yang terkenal dengan kesetiaan, keberanian, dan kehormatan yang luar biasa. Dalam hikayat ini, Hang Tuah digambarkan sebagai pahlawan yang tidak hanya memiliki kekuatan fizikal, tetapi juga memiliki kebijaksanaan yang tinggi dan prinsip yang teguh. Dia terkenal dengan kesetiaannya kepada sultan dan negara, meskipun berhadapan dengan pengkhianatan dan cabaran besar dalam hidupnya.\nSelain itu, hikayat ini juga menggambarkan hubungan yang rumit antara Hang Tuah dengan empat sahabatnya – Hang Jebat, Hang Lekir, Hang Lekiu, dan Hang Kasturi – serta konflik yang timbul daripada persahabatan dan kesetiaan. Cerita ini penuh dengan nilai-nilai tradisional yang sangat penting dalam budaya Melayu, termasuk konsep keberanian, pengorbanan, dan pengabdian. *Hikayat Hang Tuah* bukan sekadar sebuah kisah tentang pahlawan, tetapi juga sebuah karya yang memaparkan perjuangan manusia dalam mencari makna kehidupan dan identiti diri dalam masyarakat.",
    "price": 50.0,
    "review": 4.6,
    "soldUnits": 1200,
    "stock": 324,
    "language": "bahasa melayu"
  },
  {
    "id": 32,
    "title": "Salina",
    "isbn": 9789678606134,
    "image": "/src/assets/images/book-32.webp",
    "author": "A. Samad Said",
    "genre": "Novel",
    "category": "fiction",
    "description": "Sebuah novel realisme sosial yang mengisahkan kehidupan seorang wanita bernama Salina, yang berjuang untuk mencari harapan dan makna hidup selepas mengalami pelbagai kesulitan pasca penjajahan di Malaysia. Melalui kehidupan Salina, karya ini menggambarkan keadaan sosial yang penuh dengan ketidakpastian, kemiskinan, dan pergolakan yang dihadapi oleh rakyat Malaysia ketika negara sedang dalam proses pemulihan.\nSalina adalah potret kehidupan selepas perang dan penjajahan, di mana keteguhan hati dan keberanian wanita ini menjadi simbol ketabahan dalam menghadapi situasi yang mencabar. Selain menekankan perjuangan peribadi Salina, novel ini juga memperlihatkan konflik sosial yang lebih luas dan ketegangan antara golongan yang berkuasa dengan masyarakat bawahan. *Salina* memberikan pembaca pandangan yang mendalam mengenai kesulitan dan penderitaan yang dialami oleh masyarakat selepas penjajahan, sambil mengangkat nilai kemanusiaan yang abadi.",
    "price": 45.0,
    "review": 4.5,
    "soldUnits": 1000,
    "stock": 148,
    "language": "bahasa melayu"
  },
  {
    "id": 33,
    "title": "Sungai Mengalir Lesu",
    "isbn": 9789670203012,
    "image": "/src/assets/images/book-33.webp",
    "author": "A. Samad Said",
    "genre": "Literary Fiction",
    "category": "fiction",
    "description": "Sebuah novel yang menyentuh perasaan mengenai kekecewaan dan perjuangan generasi selepas kemerdekaan Malaysia, *Sungai Mengalir Lesu* menggambarkan pelbagai konflik yang timbul akibat perubahan sosial dan politik yang berlaku pasca kemerdekaan. Novel ini menyelami kehidupan seorang pemuda yang cuba mencari makna dalam dunia yang semakin kompleks dan penuh dengan cabaran ekonomi dan sosial. Konflik batin yang dihadapi oleh watak utama menjadi metafora bagi ketidakpastian yang dirasai oleh rakyat Malaysia yang sedang berusaha menyesuaikan diri dengan era pasca-kemerdekaan.\nDalam novel ini, A. Samad Said mengangkat tema ketidakpuasan dan kekecewaan generasi muda yang melihat harapan mereka semakin suram dengan berlalunya waktu. Meskipun negara telah merdeka, perubahan sosial yang mendalam, termasuk perubahan dalam nilai dan norma masyarakat, membawa ketegangan yang menggugat identiti dan arah hidup generasi yang baru. *Sungai Mengalir Lesu* mengajak pembaca untuk merenung tentang makna kemerdekaan dan perjuangan untuk mencari jati diri dalam dunia yang semakin berubah.",
    "price": 55.0,
    "review": 4.7,
    "soldUnits": 950,
    "stock": 42,
    "language": "bahasa melayu"
  },
  {
    "id": 34,
    "title": "Laskar Pelangi",
    "isbn": 9789797808653,
    "image": "/src/assets/images/book-34.webp",
    "author": "Andrea Hirata",
    "genre": "Inspirational Fiction",
    "category": "fiction",
    "description": "Kisah sekumpulan kanak-kanak di sebuah kampung terpencil yang berusaha mendapatkan pendidikan walaupun pelbagai cabaran, *Laskar Pelangi* menggambarkan ketabahan dan harapan yang tak pernah pudar dalam menghadapi kesulitan hidup. Dalam novel ini, Andrea Hirata menceritakan tentang kehidupan 10 pelajar dari Kampung Gantung yang melalui segala bentuk rintangan untuk mendapatkan ilmu, meskipun sekolah mereka kekurangan kemudahan dan guru-guru yang berdedikasi.\nMelalui karakter-karakter yang penuh semangat dan cita-cita yang tinggi, *Laskar Pelangi* bukan hanya sekadar kisah inspirasi tentang pendidikan, tetapi juga tentang persahabatan, keberanian, dan tekad yang tidak mengenal batas. Setiap peristiwa dalam novel ini menyentuh hati pembaca dengan pesan-pesan penting mengenai pentingnya pendidikan dan perjuangan untuk mencapai impian meskipun hidup penuh dengan tantangan dan kesulitan.",
    "price": 60.0,
    "review": 4.8,
    "soldUnits": 2000,
    "stock": 234,
    "language": "bahasa melayu"
  },
  {
    "id": 35,
    "title": "Bumi Manusia",
    "isbn": 9789793704174,
    "image": "/src/assets/images/book-35.webp",
    "author": "Pramoedya Ananta Toer",
    "genre": "Historical Fiction",
    "category": "historical",
    "description": "Sebuah novel sejarah yang berlatarbelakangkan zaman penjajahan Belanda, *Bumi Manusia* mengisahkan kehidupan Minke, seorang pemuda Jawa yang terlibat dalam perjuangan politik dan sosial semasa era kolonial. Novel ini menggambarkan perjuangan Minke dalam mencari identitas diri serta pengaruhnya terhadap perubahan sosial dan politik di tanah airnya. Dalam kisah ini, Minke berhadapan dengan ketidakadilan yang datang dari penjajahan dan sistem kelas yang tertanam dalam masyarakat.\nMelalui watak-watak seperti Nyai Ontosoroh, seorang wanita pribumi yang kuat, *Bumi Manusia* tidak hanya menceritakan tentang perjuangan individu, tetapi juga menggambarkan gambaran luas mengenai konflik antara kelas sosial, budaya, dan bangsa. Novel ini menyentuh tema besar seperti kebebasan, penindasan, dan pencarian makna hidup dalam konteks kolonialisme yang menekan. *Bumi Manusia* adalah salah satu karya besar dari Pramoedya Ananta Toer yang memperlihatkan dampak sejarah terhadap kehidupan manusia, serta semangat untuk melawan penindasan.",
    "price": 70.0,
    "review": 4.7,
    "soldUnits": 1500,
    "stock": 100,
    "language": "bahasa melayu"
  },
  {
    "id": 36,
    "title": "Puteri Gunung Ledang",
    "isbn": 9789834341267,
    "image": "/src/assets/images/book-36.webp",
    "author": "Emila Yusof",
    "genre": "Legendary Fiction",
    "category": "fiction",
    "description": "Puteri Gunung Ledang adalah sebuah kisah legenda yang telah lama menginspirasi masyarakat Melayu. Cerita ini berkisarkan tentang seorang puteri yang cantik dan penuh misteri, yang hidup di puncak Gunung Ledang. Seorang pahlawan bernama Hang Tuah, yang terkenal dengan keberanian dan kehebatannya, jatuh cinta padanya dan berusaha untuk menawan hati sang puteri. Namun, untuk mendapatkan cinta Puteri Gunung Ledang, Hang Tuah harus menghadapi pelbagai ujian dan cabaran yang menuntut pengorbanan besar.\nDengan latar belakang legenda yang kuat dan penuh dengan simbolisme budaya, *Puteri Gunung Ledang* menggambarkan tema cinta yang suci, keberanian untuk berjuang demi cinta, dan keteguhan untuk mengatasi halangan yang dihadapi. Novel ini membawa pembaca melalui perjalanan yang penuh dengan pengorbanan, kekuatan jiwa, dan perjalanan batin, serta menyentuh tentang nilai-nilai tradisional yang masih relevan dalam kehidupan masa kini.",
    "price": 70.0,
    "review": 4.7,
    "soldUnits": 1400,
    "stock": 479,
    "language": "bahasa melayu"
  },
  {
    "id": 37,
    "title": "Rindu",
    "isbn": 9789674113882,
    "image": "/src/assets/images/book-37.webp",
    "author": "Eric Muirhead",
    "genre": "Romantic Fiction",
    "category": "fiction",
    "description": "Rindu adalah sebuah kisah yang penuh dengan perasaan tentang cinta dan kerinduan, mengisahkan perjalanan dua kekasih yang terpisah oleh masa, jarak, dan keadaan. Novel ini menggali kompleksiti cinta, kesakitan akibat perpisahan, dan kerinduan mendalam yang terus ada walaupun takdir kelihatan kejam. Ketika watak-watak utama mengharungi perjalanan waktu dan cabaran peribadi, hati mereka tetap terikat oleh hubungan yang tidak dapat dielakkan, membawa mereka ke jalan untuk bersatu kembali dan menyembuhkan luka.\nDi terasnya, *Rindu* meneroka tema sejagat tentang kehilangan, harapan, dan ikatan yang tidak terputus antara jiwa yang ditakdirkan untuk bersama. Novel ini dengan indah merakamkan emosi kerinduan dan sifat abadi cinta sejati, sambil menonjolkan ketahanan semangat manusia dan kuasa untuk menyatukan semula mereka yang kita sayangi.",
    "price": 50.0,
    "review": 4.5,
    "soldUnits": 1100,
    "stock": 189,
    "language": "bahasa melayu"
  },
  {
    "id": 38,
    "title": "Keluarga Gerilya",
    "isbn": 9789792283392,
    "image": "/src/assets/images/book-38.webp",
    "author": "Pramoedya Ananta Toer",
    "genre": "Historical Fiction",
    "category": "historical",
    "description": "Keluarga Gerilya adalah sebuah novel yang mendalam yang menggali semangat perlawanan dan kelangsungan hidup semasa perjuangan kemerdekaan Indonesia. Kisah ini memfokuskan pada kehidupan seharian sebuah keluarga yang, di tengah-tengah peperangan, mencerminkan keberanian dan pengorbanan rakyat biasa yang terlibat dalam perjuangan gerila. Melalui pengalaman mereka, novel ini menawarkan gambaran yang kuat tentang pergolakan sosial dan politik pada masa itu.\nNovel ini bukan sekadar menggambarkan peristiwa sejarah, tetapi juga merupakan eksplorasi intim tentang kos manusia akibat peperangan—menyoroti kekuatan, ketahanan, dan perpaduan sebuah keluarga ketika mereka mengharungi kekacauan dan kesulitan gerakan kemerdekaan. *Keluarga Gerilya* merakamkan inti pengorbanan dan komitmen yang tidak tergoyahkan dari rakyat biasa dalam membentuk masa depan negara, menjadikannya sebuah karya fiksyen sejarah yang menyentuh hati dan memberi pemikiran mendalam.",
    "price": 60.0,
    "review": 4.4,
    "soldUnits": 1200,
    "stock": 67,
    "language": "bahasa melayu"
  },
  {
    "id": 39,
    "title": "Habis Gelap Terbitlah Terang",
    "isbn": 9789792155206,
    "image": "/src/assets/images/book-39.webp",
    "author": "Raden Adjeng Kartini",
    "genre": "Non-fiction",
    "category": "non-fiction",
    "description": "Buku ini menceritakan perjalanan hidup seorang pahlawan wanita, R.A Kartini, yang melalui surat-suratnya yang ditujukan kepada saudari dan sahabat-sahabatnya, mengungkapkan cita-cita besar untuk memperjuangkan hak-hak wanita di Indonesia. Surat-surat ini bukan sahaja mencerminkan pemikiran Kartini mengenai perubahan sosial, tetapi juga harapan-harapannya untuk melihat kemajuan kaum wanita di masa depan. Melalui penulisan ini, Kartini menyuarakan keinginannya untuk membebaskan wanita dari belenggu tradisi yang membatasi kebebasan dan potensi mereka.\nHabis Gelap Terbitlah Terang bukan sekadar sebuah koleksi surat, tetapi merupakan sebuah pernyataan perjuangan bagi kesetaraan gender dan pendidikan. Buku ini mengisahkan tentang hidup Kartini yang penuh dengan pemikiran mendalam, cita-cita yang tak kenal lelah, dan usaha untuk memperbaiki nasib wanita, menjadikannya sebagai salah satu tokoh penting dalam sejarah Indonesia.",
    "price": 45.0,
    "review": 4.3,
    "soldUnits": 800,
    "stock": 68,
    "language": "bahasa melayu"
  },
  {
    "id": 40,
    "title": "Hikayat Amir Hamzah",
    "isbn": 9789672215423,
    "image": "/src/assets/images/book-40.webp",
    "author": "Abdul Samad Ahmad",
    "genre": "Historical Epic",
    "category": "historical",
    "description": "Penerbitan semula karya-karya klasik dengan pendahuluan atau kata pengantar yang lebih ilmiah oleh para sarjana tempatan amat berguna sebagai bahan rujukan para pelajar dan pengkaji sastera, di samping memperbanyak khazanah sastera negara.\nHikayat Amir Hamzah menceritakan perihal kegagahan dan keperwiraan seorang pejuang Islam, iaitu Amir Hamzah, pada zaman sebelum dan awal kebangkitan Islam. Hikayat ini merupakan teks sastera yang amat penting, dilihat dari sudut emosi, isi, dan nilai budaya yang terkandung di dalamnya.\nHikayat Amir Hamzah adalah antara karya dari Asia Barat yang telah diubahsuai oleh pengarang-pengarang Melayu zaman silam supaya sesuai dengan khalayak tempatan, dalam usaha mereka mengembangkan agama Islam di Nusantara ini.",
    "price": 55.0,
    "review": 4.1,
    "soldUnits": 1000,
    "stock": 150,
    "language": "bahasa melayu"
  },
  {
    "id": 41,
    "title": "Hujan",
    "isbn": 9786020324784,
    "image": "/src/assets/images/book-41.webp",
    "author": "Tere Liye",
    "genre": "Indonesian Literature",
    "category": "fiction",
    "description": "Sebuah novel yang menyelami kehidupan seorang budak lelaki yang menghadapi pelbagai kesulitan dan perubahan semasa membesar. Dengan latar belakang kehidupan yang penuh dengan cabaran, novel ini meneroka tema keluarga, cinta, dan ketabahan. Ia menggambarkan bagaimana seorang individu berkembang melalui perasaan kehilangan, perjuangan untuk harapan, serta pencarian identiti diri dalam menghadapi ujian hidup yang sukar. *Hujan* membawa pembaca kepada perjalanan yang emosional, menyentuh hati dan mencabar pemikiran mengenai nilai-nilai kehidupan.",
    "price": 75.0,
    "review": 3.9,
    "soldUnits": 700,
    "stock": 57,
    "language": "bahasa melayu"
  },
  {
    "id": 42,
    "title": "Laut Bercerita",
    "isbn": 9786024246945,
    "image": "/src/assets/images/book-42.webp",
    "author": "Leila S. Chudori",
    "genre": "Indonesian Literature",
    "category": "fiction",
    "description": "Di sebuah senja, di sebuah rumah susun di Jakarta, mahasiswa bernama Biru Laut disergap empat lelaki tak dikenal. Bersama kawan-kawannya, Daniel Tumbuan, Sunu Dyantoro, Alex Perazon, dia dibawa ke sebuah tempat yang tak dikenal. Berbulan-bulan mereka disekap, diinterogasi, dipukul, ditendang, digantung, dan disetrum agar bersedia menjawab satu pertanyaan penting: siapakah yang berdiri di balik gerakan aktivis dan mahasiswa saat itu.",
    "price": 45.0,
    "review": 3.9,
    "soldUnits": 750,
    "stock": 30,
    "language": "bahasa melayu"
  },
  {
    "id": 43,
    "title": "Di Tanah Lada",
    "isbn": 9786020318967,
    "image": "/src/assets/images/book-43.webp",
    "author": "Ziggy Zezsyazeoviennazabrizkie",
    "genre": "Contemporary",
    "category": "fiction",
    "description": "Kenali Ava, seorang gadis yang terperangkap dalam dunia yang penuh dengan pengabaian dan harapan. Dikenali sebagai Saliva oleh ayahnya, Ava membesar dalam ketidakpastian, namun dengan hadiah kamus dari Kakek Kia, dia menemukan kekuatan baru. Dari kehidupan yang penuh cabaran di Rusun Nero, Ava berjuang untuk mencari tempat dan makna hidupnya. *Di Tanah Lada* adalah sebuah kisah penuh emosi tentang pencarian diri, kekuatan bahasa, dan hubungan keluarga yang berliku. Sebuah cerita yang akan menggetarkan hati anda, menjadikan anda lebih menghargai setiap kata dan makna di sebaliknya. Jangan lepaskan peluang untuk menyelami perjalanan hidup Ava yang penuh inspirasi ini!",
    "price": 45.0,
    "review": 4.3,
    "soldUnits": 200,
    "stock": 1000,
    "language": "bahasa melayu"
  },
  {
    "id": 44,
    "title": "Seperti Dendam, Rindu Harus Dibayar Tuntas",
    "isbn": 9786020303932,
    "image": "/src/assets/images/book-44.webp",
    "author": "Eka Kurniawan",
    "genre": "Indonesian Literature",
    "category": "fiction",
    "description": "Di tengah kegelapan sebuah rejim yang penuh kekerasan, *Seperti Dendam, Rindu Harus Dibayar Tuntas* membawa pembaca ke dalam dunia yang keras dan penuh ketegangan. Kisah bermula dengan peristiwa mengejutkan yang mencabar kemanusiaan, diikuti dengan perjalanan penuh gejolak yang menyoroti kehidupan yang terpecah-pecah. Dua bocah yang menyaksikan kekejaman melalui lubang jendela, dan seekor burung yang memilih untuk tidur panjang, mencerminkan alegori tentang kehidupan yang lebih damai yang mustahil dicapai. Sebuah novel yang menggugah, memaksa kita untuk merenung tentang pengorbanan, keadilan, dan harapan di dunia yang penuh kekerasan. Temui perjalanan yang mendalam ini dan rasai setiap perasaan yang dikisahkan dalam halaman-halamannya. Jangan lepaskan peluang untuk memiliki buku ini, yang tidak hanya akan mengubah perspektif, tetapi juga menyentuh hati.",
    "price": 65.0,
    "review": 3.9,
    "soldUnits": 250,
    "stock": 23,
    "language": "bahasa melayu"
  },
  {
    "id": 45,
    "title": "Ronggeng Dukuh Paruk",
    "isbn": 9786024246945,
    "image": "/src/assets/images/book-45.webp",
    "author": "Ahmad Tohari",
    "genre": "Indonesian Literature",
    "category": "fiction",
    "description": "Di sebuah pedukuhan yang kecil dan terpencil, kehidupan kembali berubah dengan kemunculan Srintil, ronggeng baru yang dinobatkan untuk menggantikan ronggeng yang telah meninggal dunia dua belas tahun yang lalu. Ronggeng Dukuh Paruk bukan sekadar kisah tentang seorang wanita yang menjadi simbol bagi masyarakatnya, tetapi tentang kekuatan tradisi, budaya, dan pencarian identiti. Bagi masyarakat Dukuh Paruk, ronggeng bukan hanya hiburan, tetapi satu warisan dan harapan yang menjadi pengikat mereka dengan masa lalu dan masa depan. Dalam kesederhanaan hidup mereka, hilangnya ronggeng adalah hilangnya jati diri. Ikuti perjalanan Srintil yang penuh perjuangan dan pengorbanan, sebuah cerita yang mengangkat nilai-nilai kemanusiaan yang mendalam. Buku ini adalah pengalaman yang akan membuka mata dan hati pembaca untuk memahami keindahan dan kerumitan hidup yang sederhana namun penuh makna.",
    "price": 85.0,
    "review": 3.9,
    "soldUnits": 1750,
    "stock": 100,
    "language": "bahasa melayu"
  }
]
